package 변수및자료형;

public class Ex03변수명 {

	public static void main(String[] args) {
		
		// 변수명 사용 규칙!
		// 1. 키워드 사용 불가능
		// ---> eclipse 작성 시 색깔이 변한다면 키워드
		// 2. 대소문자를 구부분하고 길이에는 제한이 없다
		// ---> 변수량은 의미전달이 중요하다. a,b,c 짓지 말자
		// 3. 숫자로 시작 할 수 없다
		// ---> 숫자는 값으로 인식한다.
		// 4. 특수문자는 _와 $ 기호만 사용가능
		
		// 자바 개발자에게 권장되는 규칙들
		// 1. 변수를 시작은 소문자
		// 2. 변수 이름을 여러글자로 이어지는 경우 뒤에 이어지는 글자
		// 를 대문자로 ----> 카멜식 기법
		// ex) inputNumber = 4;
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
	}

}
